Tekla Open API Reference for Tekla Structures 2025
BoltXYList.AddBoltDistX Method
 Adds an X distance to the bolt XY list.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AddBoltDistX(
	double DistX
)
Public Function AddBoltDistX (
	DistX As Double
) As Boolean
Parameters
DistX
Type: System.Double
The X distance to be added.
Return Value
Type: Boolean
True if the distance was added. Throws an OverflowException if there was no more space for the distance.
See Also
Reference
BoltXYList Class
Tekla.Structures.Model Namespace